In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [10]:
#step 3
columns = ['name', 'sex', 'birth']
yobs = []

for year in range(1880, 2019):
    path = f"./names/yob{year}.txt"
    df = pd.read_csv(path, names=columns)
    df['year'] = year
    yobs.append(df)

names = pd.concat(yobs, ignore_index=True)
names.head()

        name sex  birth  year
0       Mary   F   7065  1880
1       Anna   F   2604  1880
2       Emma   F   2003  1880
3  Elizabeth   F   1939  1880
4     Minnie   F   1746  1880